# Data Inspection & Exploration

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'city': ['Delhi', 'Mumbai', 'Delhi', 'Chennai', 'Mumbai'],
    'sales': [100, 150, 120, 90, 160],
    'discount': [5, 10, np.nan, 7, 10]
})

df.head()

      city  sales  discount
0    Delhi    100       5.0
1   Mumbai    150      10.0
2    Delhi    120       NaN
3  Chennai     90       7.0
4   Mumbai    160      10.0

In [2]:
df.tail()

      city  sales  discount
0    Delhi    100       5.0
1   Mumbai    150      10.0
2    Delhi    120       NaN
3  Chennai     90       7.0
4   Mumbai    160      10.0

In [3]:
df.sample(2, random_state=1)

     city  sales  discount
2   Delhi    120       NaN
1  Mumbai    150      10.0

## Structure

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      5 non-null      object
 1   sales     5 non-null      int64
 2   discount  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

## Summary statistics

In [5]:
df.describe()

            sales  discount
count    5.000000   4.00000
mean   124.000000   8.00000
std     30.495901   2.44949
min     90.000000   5.00000
25%    100.000000   6.50000
50%    120.000000   8.50000
75%    150.000000  10.00000
max    160.000000  10.00000

## Data types

In [6]:
df.dtypes

city         object
sales         int64
discount    float64
dtype: object

## Value counts

In [7]:
df['city'].value_counts()

city
Delhi      2
Mumbai     2
Chennai    1
Name: count, dtype: int64

## Unique values

In [8]:
df['city'].unique()

array(['Delhi', 'Mumbai', 'Chennai'], dtype=object)

In [9]:
df['city'].nunique()

3

## Memory usage

In [10]:
df.memory_usage(deep=True)

Index       132
city        274
sales        40
discount     40
dtype: int64


- Start with `head()`, `info()`, and `describe()`
- Verify `dtypes` before analysis
- Use `value_counts()` for categorical columns
- Monitor memory early for scalability